# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [19]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

In [6]:
cur.execute('''
SELECT firstName, lastName, city, state 
FROM employees JOIN offices 
USING (officeCode)
ORDER BY firstName;

''')
df = pd.DataFrame(cur.fetchall())
print('Number of results', len(df))
df.head()

Number of results 23

          0       1              2   3
0      Andy  Fixter         Sydney
1   Anthony     Bow  San Francisco  CA
2     Barry   Jones         London
3     Diane  Murphy  San Francisco  CA
4  Foon Yue   Tseng            NYC  NY

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [7]:
cur.execute('''
SELECT customerName,orderNumber,orderDate,status 
FROM customers JOIN orders 
USING (customerNumber);

''')
df = pd.DataFrame(cur.fetchall())
print('Number of results', len(df))
df.head()

Number of results 326

                    0      1           2        3
0   Atelier graphique  10123  2003-05-20  Shipped
1   Atelier graphique  10298  2004-09-27  Shipped
2   Atelier graphique  10345  2004-11-25  Shipped
3  Signal Gift Stores  10124  2003-05-21  Shipped
4  Signal Gift Stores  10278  2004-08-06  Shipped

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [14]:
cur.execute('''
SELECT *
FROM orders JOIN orderDetails 
USING (orderNumber);

''')
df = pd.DataFrame(cur.fetchall())
print('Number of results', len(df))
df.head()

Number of results 2996

,0,1,2,3,4,5,6,7,8,9,10
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_1749,30,136.00,3
1,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_2248,50,55.09,2
2,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_4409,22,75.46,4
3,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S24_3969,49,35.29,1
4,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128,S18_2325,25,108.06,4

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and all the product information for each product in the order.

In [20]:
cur.execute('''
SELECT orderNumber, productCode, textDescription, image
FROM orders JOIN orderdetails
USING (orderNumber);
JOIN products
USING (productCode)
JOIN productline
USING (productLine);

''')
df = pd.DataFrame(cur.fetchall())
print('Number of results', len(df))
df.head()

OperationalError: no such column: textDescription

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!